PANDA BASIC SERIES CREATION : Series is a one-dimensional labeled array capable of holding data of any type (integer, string, float, python objects, etc.). The axis labels are collectively called index.

In [37]:
import numpy as np
import pandas as pd

a = np.array(['AA','BB','CC'])
print('Numpy Array:',a)
print('Series')
s = pd.Series(a)
print(s)
print(s[1])

#following code will throw error beacuse Series only for one-dimensional  
# arr = np.array([['AA','BB','CC'],['DD','EE','FF']])
# sr = pd.Series(arr)
# print(sr)

Numpy Array: ['AA' 'BB' 'CC']
Series
0    AA
1    BB
2    CC
dtype: object
BB

SERIES CREATE FROM DICTIONARY

In [14]:
arr = {'AA':11,'BB':22,'CC':33}
s = pd.Series(arr)
print(s)
print(s['CC'])

AA    11
BB    22
CC    33
dtype: int64
33

In [29]:
lst = ['Math','Chem','Bio']
lst1 = ['Math','Chem','Bio','Beng']


s1 = pd.Series((45,56,78),index=lst)
s2 = pd.Series((45,56,78,98),index=lst1)
print(s1) 
print(s2) 
s3 = pd.Series({'Amit':s1})
print(s3)

Math    45
Chem    56
Bio     78
dtype: int64
Math    45
Chem    56
Bio     78
Beng    98
dtype: int64
Amit    Math    45
Chem    56
Bio     78
dtype: int64
dtype: object
Math    12
Chem    34
Bio     55
Beng    66
dtype: int64

DATAFRAME: DataFrame is a 2-dimensional labeled data structure with columns of potentially different types. You can think of it like a spreadsheet or SQL table, or a dict of Series objects. It is generally the most commonly used pandas object

In [24]:
table = pd.DataFrame({'Amit':s1,'Tanoy':s2})
print(table) # NaN means "not a number",any calculations you perform with NaN will also result in NaN

      Amit  Tanoy
Beng   NaN     98
Bio   78.0     78
Chem  56.0     56
Math  45.0     45

ADD COLUMN IN DATAFRAME: CREATE DATAFRAME AND ADD VIA DATAFRAME INDEX

In [39]:
lst2 = ['Math','Chem','Bio','Beng','Eng']
table['Budha'] = pd.DataFrame([12,34,55,66,67],index=lst2)
print(table) # Eng row not added

      Amit  Budha  Tanoy
Beng   NaN   66.0     98
Bio   78.0   55.0     78
Chem  56.0   34.0     56
Math  45.0   12.0     45
0     23.0    NaN     89

ADD ROW IN DATAFRAME: CREATE DATAFRAME AND APPEND IN THAT DATAFRAME

In [40]:
row = pd.DataFrame([[23,45,89]],columns=['Amit','Budha','Tanoy'])
print(row)
table = table.append(row)
print(table)

   Amit  Budha  Tanoy
0    23     45     89
      Amit  Budha  Tanoy
Beng   NaN   66.0     98
Bio   78.0   55.0     78
Chem  56.0   34.0     56
Math  45.0   12.0     45
0     23.0    NaN     89
0     23.0   45.0     89

READ DATA FROM CSV AND REPLACE VALUE AND FINALLY WRITE TO CSV

In [56]:
table = pd.read_csv('bank-data.csv')
table['y'].replace(['yes'],1,inplace=True) # Replace value
table.to_csv('test.csv',sep=',', encoding='utf-8') # write to csv
print(table)

     age            job   marital  y
0     20        student    single  1
1     32     management    single  1
2     49     technician   married  1
3     32    blue-collar   married  1
4     33     management   married  1
5     61         admin.   married  1
6     45    blue-collar  divorced  1
7     34     technician   married  1
8     37     management   married  1
9     27         admin.  divorced  1
10    52       services   married  1
11    37     management   married  1
12    27       services    single  1
13    21        student    single  1
14    25        student    single  1
15    25     technician    single  1
16    34  self-employed    single  1
17    52     management   married  1
18    55         admin.   married  1
19    28     management    single  1
20    35     technician    single  1
21    29    blue-collar    single  1
22    42     management   married  1
23    29    blue-collar    single  1
24    24    blue-collar    single  1
25    34         admin.   married  1
26    50    blue-collar   married  1
27    49   entrepreneur  divorced  1
28    45    blue-collar  divorced  1
29    38   entrepreneur   married  1
..   ...            ...       ... ..
417   62  self-employed  divorced  1
418   39       services  divorced  1
419   38     technician    single  1
420   31    blue-collar   married  1
421   33     technician    single  1
422   36     technician    single  1
423   32     management    single  1
424   34      housemaid   married  1
425   59     technician   married  1
426   25        student   married  1
427   53     management   married  1
428   52     management   married  1
429   34         admin.  divorced  1
430   49         admin.   married  1
431   50    blue-collar   married  1
432   29    blue-collar    single  1
433   41   entrepreneur   married  1
434   45         admin.  divorced  1
435   32    blue-collar    single  1
436   45     management    single  1
437   40     management   married  1
438   49    blue-collar    single  1
439   29     management    single  1
440   38     management    single  1
441   38     management   married  1
442   26     technician    single  1
443   60  self-employed   married  1
444   42    blue-collar    single  1
445   32         admin.    single  1
446   46    blue-collar   married  1

[447 rows x 4 columns]

SLICING IN DATAFRAME AND

In [47]:
print(table['job'].unique())
print(table[table['marital']=='married'].count())
print(table['age'][table['job']=='technician'].count())

['student' 'management' 'technician' 'blue-collar' 'admin.' 'services'
 'self-employed' 'entrepreneur' 'housemaid']
age        226
job        226
marital    226
y          226
dtype: int64
83